{"intents": [
        {"tag": "greeting",
         "patterns": ["hi", "how are you", "is anyone there?", "hello"],
         "responses": ["Hello, thanks for visiting", "Good to see you again", "Hi there, how can I help?"],
         "context_set": ""
        },
        {"tag": "goodbye",
         "patterns": ["bye", "see you later", "goodbye"],
         "responses": ["See you later, thanks for visiting", "Have a nice day", "Bye! Come back again soon."]
        },
        {"tag": "thanks",
         "patterns": ["thanks", "thank you", "that's helpful"],
         "responses": ["Happy to help!", "Any time!", "My pleasure"]
        },
        {"tag": "hours",
         "patterns": ["what hours are you open?", "what are your hours?", "when are you open?", "what time are you open"],
         "responses": ["We're open every day 9am-9pm", "Our hours are 9am-9pm every day"]
        },
        {"tag": "boiling point",
         "patterns": ["what is the boiling point of water?", "at what temperature does water boil?"],
         "responses": ["The boiling point of water is 100 degrees celcius", "The boiling point of water is 212 degrees farenheit"]
        },
        {"tag": "open",
         "patterns": ["when is the lab open?", "when do you open today?", "what are your hours today?"],
         "responses": ["We're open every day from 8am to 6pm", "Our hours are 8am to 6pm every day"]
        },
        {"tag": "Temperature range",
          "patterns": ["What is the temperature range of the machine", "How hot can the water get", "How cold can the water get", "How high can the temperature get?", "how low can the temperature get"],
          "responses": ["The maximum water temperature is fifty seven degrees and the minimum water temperature is twenty degrees"]

        },
        {"tag": "Heating procedure",
          "patterns": ["how do you heat the water", "how do you raise the set point", "how do you raise the process temperature", "describe the heating procedure"],
          "responses": ["The heater is turned on and it heats the water in the hot water tank, The hot water is then pumped to the hot water exchanger and recirculated back to the hot water tank, The water in the process tank is pumped to the chiller exchanger then to the hot water exchanger and then recirculated back to the process tank, The interaction of the hot water and the normal temperature water in the hot water exchanger causes a temperature rise in the water from the process tank, The three way valve in the hot water circulation side close to the hot water pump is controlled by a PID block in relation to the temperature measured by the RTD connected to the hot water exchanger, the temperature of the water in the process tank is measured by the thermocouple in the process tank, this recirculation goes on until the process temperature reaches the setpoint"]
        },
        {"tag": "Cooling procedure",
          "patterns": ["how do you cool the water", "how do you lower the set point", "how do you lower the process temperature", "how do you decrease the process temperature", "Describe the cooling procedure"],
          "responses": ["The chiller has to be manually turned on since it is a discrete output, the process pump, pumps the water in the process tank to the chiller exchanger then to the hot water exchanger and back to the process tank, The chiller circulates the cooling fluid through the chiller exchanger, The interaction between the water and the cooling fluid in the chiller exchanger reduces the temperature of the water, Once the set point has been achieved you should manually turn the chiller off, since it is a discrete output"]
        },
        {"tag": "System description",
          "patterns": ["how does the system work", "how does the machine work", "describe the system to me", "tell me everything about your system", "describe the parts of the system to me"],
          "responses": ["The tank on the bottom left is called the process tank, It store the water that undergoes the heating or the cooling process depending on the set point given it has a thermocouple connected, It is used to measure the temperature of the water in the process tank,Next to the process tank is the process pump, The process pump, pumps water to the chiller or the heat exchanger depending on the set point given, The exchangers are attached to the top part of the machine, The chiller exchanger is on the bottom attached to the chiller while the heat exchanger is on the top attached to a RTD, we use the RTD to determine the opening of the three way valve during the heating process by using the PID block, The chiller is located on the base of the machine on the right side of the process pump, It has an inbuilt refrigeration system which uses R34A as the cooling fluid, The tank on the top side of the machine is a hot water tank, It contains a heater and a float switch, The float switch ensures that the heater can only be turned on if the water level is above 60% of the volume of the tank, Directly below the hot water tank is the hot water pump, The hot water pump, pumps hot water through the three way valve to the heat exchanger,The three way valve is controlled by a compressor using a PID block in the PLC program, It is used to control the amount of hot water flowing to the heat exchanger, To do that the compressor is connected to an I/P converter that is located below the hot water tank on the right side, The PID block directly controls the I/P converter which delivers the required amount of pressure to the three way valve"]
        },
        {"tag": "Sensors",
          "patterns": ["how many sensors do you have", "how do your sensors operate", "how do your sensors work", "tell me how your sensors work"],
          "responses": [" The thermal process control station has different types of sensors,One, Rotameter, this is a device that measures the volumetric flow rate of a fluid in a closed tube, One is between the chiller and the heat exchanger, between heat exchanger and hot water under the hot water tank,Two, RTD, a resistance temperature detector is a sensor whose existence changes as its temperature changes, It is directly connected to the heat exchanger and it’s used to increase the temperature of the water in its process tank,Three, Thermocouple, this is a sensor for measuring temperature of the water in the process tank,Four, Float switch, this detects the level of a liquid in a tank or container, It floats on the top of the liquid surface and acts as a mechanical switch as the liquid level goes up or down, In our machine it is located in the hot water tank and it controls the water, The heater is turned on only if the water level is greater than 60%, else it’s turned off,Five, Temperature gauge, This is an analog device used to indicate the temperature of an item being monitored, They are located in the tanks and the pipes,Six, Flow switch, This is a mechanical switch that is activated on or off in a response to the flow or non-flow of water, It is the white thing connected to the pipe between the process pump and the chiller,Seven, IP converter, a current to pressure transducer, is a small module device used in application to translate a current analogue signal (I) into a pneumatic output (P), It is located next to the hot water pump on the right, It is used to control the three way valve used to connect the hot water tank with the hot water heat exchanger,Those are the seven main sensors of the thermal process control station"]

        }
   ]
}